; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image4 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	spectrograph3 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star7 - direction
	Star2 - direction
	Star6 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument3 image4)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star5)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument6 spectrograph2)
	(supports instrument6 thermograph0)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image4)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star5)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite1 Star10)
	(pointing satellite2 Star5)
	(have_image Planet8 image4)
	(have_image Phenomenon9 spectrograph3)
	(have_image Star10 image4)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 thermograph0)
))

)

; plan
1. (turn_to satellite0 star6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star6)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet12)
   goals met: 0 of 7
5. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon9 instrument0 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon11 instrument0 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 3 of 7
10. (turn_to satellite0 planet8 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet8)
   goals met: 3 of 7
11. (take_image satellite0 planet8 instrument0 image4)
   added: (have_image planet8 image4)
   goals met: 4 of 7
12. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 4 of 7
13. (take_image satellite0 star10 instrument0 image4)
   added: (have_image star10 image4)
   goals met: 5 of 7
14. (turn_to satellite1 star10 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star10)
   goals met: 6 of 7
15. (turn_to satellite2 star5 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star5)
   goals met: 7 of 7
